app/controllers/widgets_controller.rb

SELECT "widgets".* FROM "widgets"
---
    def index
      @widgets = Widget.all

INSERT INTO "widgets" ("name", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Test 1"], ["description", "This is test description 1"], ["status", 1], ["created_at", "2024-01-27 19:29:08.723274"], ["updated_at", "2024-01-27 19:29:08.723274"]]
---
    def create
      @widget = Widget.new(widget_params)

      if @widget.save

UPDATE "widgets" SET "status" = ?, "created_at" = ?, "updated_at" = ? WHERE "widgets"."id" = ?  [["status", 0], ["created_at", "2024-01-28 19:06:10.197000"], ["updated_at", "2024-01-29 09:29:41.371000"], ["id", 3]]
---
    def update
      set_widget
      data_sent = JSON.parse(request.raw_post())

      @widget.status = data_sent['status']
      @widget.description = data_sent['description']

      if @widget.update(widget_params)

DELETE FROM "widgets" WHERE "widgets"."id" = ?  [["id", 5]]
---
    def destroy
      set_widget
      @widget.destroy

SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_widget
      @widget = Widget.find(params[:id])